<template>
  <div class="methods">
    <h2><b>记单词</b></h2>
    <p>记单词界面从上到下本别是：单词显示区、翻译显示区、操作按钮区</p>
    <p>翻译显示必须通过点击才能显示翻译，我默认是记住了这个单词，这样能提高效率，以及不会因为看到了翻译以为自己记住了。切换到下一个单词之后要显示翻译同样是要点击翻译区</p>
    <p>点击收藏按钮会将单词收藏到单词本，可以在我的-->我的收藏 里面查看。再次点击收藏按钮之后会将收藏单词从我的收藏里面移除</p>
    <p>点击下一个按钮会切换到下一个单词。点击单词预览的时候单词的颜色会显示蓝色。</p>
    <p>点击不知道按钮会切换到一下单词。点击单词预览的时候单词颜色会显示红色。</p>
    <p>点击页面右上角的按钮可以切换单词预览与记单词。单词预览界面的单词会有三种颜色，灰色代表单词还没有展示出来，蓝色表示这个单词已经记住了，红色表示这个单词不知道是什么意思</p>
    <h2><b>切换单词书</b></h2>
    <p>点击单词书后可以切换单词书，然后点击展开之后可以选择章节。我推荐的是一章一章地去记单词</p>
  </div>
</template>

<script>
export default {
  name: 'Methods'
}
</script>

<style scoped>
  .methods {
    padding:10px;
    background: #fff;
  }

  .methods h2 {
    font-size: 20px;
    margin: 10px 0;
  }

  .methods p {
    font-size: 16px;
    margin: 10px 0;
  }
</style>